Autodesk.Revit.UI.DoubleClickOptions.IsSupportedAction(Autodesk.Revit.UI.DoubleClickTarget,Autodesk.Revit.UI.DoubleClickAction)
Checks whether the specified double-click target supports the specified action.
target:
The double-click target to check.
action:
The desired double-click action.
Returns:
True if the target supports the specified action, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.DoubleClickOptions.SetAction(Autodesk.Revit.UI.DoubleClickTarget,Autodesk.Revit.UI.DoubleClickAction)
Changes the double-click action associated with a specified target.
Remarks:
This change will be stored in the user's profile and will affect future sessions of Revit in
addition to the current session.
target:
The double-click target whose action will be changed.
action:
The action to assign to the target.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified action is not valid for the target element.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.DoubleClickOptions.GetAction(Autodesk.Revit.UI.DoubleClickTarget)
Returns the active user's desired action for a particular double-click target.
target:
The target to check.
Returns:
The user's desired action for the specified target.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.DoubleClickOptions.SetRenameOnSlowDoubleClickInProjectBrowser(System.Boolean)
Sets whether the desired action is to rename item in project browser on slow double-click.
Since:
2016

Autodesk.Revit.UI.DoubleClickOptions.GetRenameOnSlowDoubleClickInProjectBrowser
Returns the user's desire to rename item in project browser on slow double-click.
Since:
2016

Autodesk.Revit.UI.DoubleClickOptions.GetDoubleClickOptions
Returns the current user's DoubleClickOptions.
Returns:
The DoubleClickOptions for the current user.
Since:
2016

Autodesk.Revit.UI.DoubleClickOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.DoubleClickOptions
Provides access to settings that control what happens when the current user double-clicks on an element.
Remarks:
These settings are stored on a per-user basis.  Revit will follow these settings for all projects and families for this user.
Since:
2016